# [Python: Pandas](https://ru.hexlet.io/courses/python-pandas)

In [11]:
import pandas as pd

## [Введение](https://ru.hexlet.io/courses/python-pandas/lessons/intro/theory_unit)

In [14]:
path = 'data/Shop_orders.csv'

In [22]:
df = pd.read_csv(path, index_col='weekday')

In [24]:
df

         shop_1  shop_2  shop_3  shop_4
weekday
mon           7       1       7       8
tue           4       2       4       5
wed           3       5       2       3
thu           8      12       8       7
fri          15      11      13       9
sat          21      18      17      21
sun          25      16      25      17

In [26]:
df.describe()

          shop_1     shop_2     shop_3     shop_4
count   7.000000   7.000000   7.000000   7.000000
mean   11.857143   9.285714  10.857143  10.000000
std     8.610625   6.725927   8.071113   6.557439
min     3.000000   1.000000   2.000000   3.000000
25%     5.500000   3.500000   5.500000   6.000000
50%     8.000000  11.000000   8.000000   8.000000
75%    18.000000  14.000000  15.000000  13.000000
max    25.000000  18.000000  25.000000  21.000000

### центрирование значений продаж по каждому магазину

In [31]:
df.mean(axis=0)

shop_1    11.857143
shop_2     9.285714
shop_3    10.857143
shop_4    10.000000
dtype: float64

In [33]:
df - df.mean(axis=0)

            shop_1    shop_2     shop_3  shop_4
weekday
mon      -4.857143 -8.285714  -3.857143    -2.0
tue      -7.857143 -7.285714  -6.857143    -5.0
wed      -8.857143 -4.285714  -8.857143    -7.0
thu      -3.857143  2.714286  -2.857143    -3.0
fri       3.142857  1.714286   2.142857    -1.0
sat       9.142857  8.714286   6.142857    11.0
sun      13.142857  6.714286  14.142857     7.0

## [Чтение и запись табличных данных в файловую систему](https://ru.hexlet.io/courses/python-pandas/lessons/io-dataflow/theory_unit)

## [Работа с индексами](https://ru.hexlet.io/courses/python-pandas/lessons/index-rules/theory_unit)

In [38]:
df_orders = pd.read_excel('./data/Orders.xlsx')
print(df_orders.head())

   shop_1  shop_2  shop_3  shop_4
0     7.0       1     7.0       8
1     4.0       2     4.0       5
2     3.0       5     NaN       3
3     8.0      12     8.0       7
4    15.0      11    13.0       9

In [40]:
type(df_orders['shop_1'])

pandas.core.series.Series

In [42]:
df_orders[['shop_1','shop_2']]

   shop_1  shop_2
0     7.0       1
1     4.0       2
2     3.0       5
3     8.0      12
4    15.0      11
5    21.0      18
6     NaN      16

In [46]:
df_orders.drop(['shop_4'], axis=1)

   shop_1  shop_2  shop_3
0     7.0       1     7.0
1     4.0       2     4.0
2     3.0       5     NaN
3     8.0      12     8.0
4    15.0      11    13.0
5    21.0      18    17.0
6     NaN      16    25.0

In [58]:
df.index

Index(['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'], dtype='object', name='weekday')

In [56]:
df_orders.index

RangeIndex(start=0, stop=7, step=1)

In [64]:
df_orders.index = ['mo', 'tu', 'we', 'th', 'fr', 'sa', 'su']

In [106]:
df_orders

    shop_1  shop_2  shop_3  shop_4
mo     7.0       1     7.0       8
tu     4.0       2     4.0       5
we     3.0       5     NaN       3
th     8.0      12     8.0       7
fr    15.0      11    13.0       9
sa    21.0      18    17.0      21
su     NaN      16    25.0      17

In [82]:
df.iloc[:-2]

         shop_1  shop_2  shop_3  shop_4
weekday
mon           7       1       7       8
tue           4       2       4       5
wed           3       5       2       3
thu           8      12       8       7
fri          15      11      13       9

In [88]:
df.iloc[:-2, :3]

         shop_1  shop_2  shop_3
weekday
mon           7       1       7
tue           4       2       4
wed           3       5       2
thu           8      12       8
fri          15      11      13

In [96]:
df.loc[:'sat']

         shop_1  shop_2  shop_3  shop_4
weekday
mon           7       1       7       8
tue           4       2       4       5
wed           3       5       2       3
thu           8      12       8       7
fri          15      11      13       9
sat          21      18      17      21

In [104]:
df.loc[:'sat',:'shop_3']

         shop_1  shop_2  shop_3
weekday
mon           7       1       7
tue           4       2       4
wed           3       5       2
thu           8      12       8
fri          15      11      13
sat          21      18      17